In [1]:
#구글 드라이브 연결
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
#출력 한 번에 나올 수 있게 설정
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'

In [4]:
filename='/content/drive/My Drive/DataSet/Lpoint/data/Product.csv'

In [5]:
srchcsv='/content/drive/My Drive/DataSet/Lpoint/data/Search1.csv'
search1 = pd.read_csv(srchcsv, dtype={"CLNT_ID":np.str, "SESS_ID":np.str})

srch2csv='/content/drive/My Drive/DataSet/Lpoint/data/Search2.csv'
search2 = pd.read_csv(srch2csv)

In [8]:
search1.head()
search2.head()

   CLNT_ID   SESS_ID     KWD_NM  SEARCH_CNT
0  5607714  07112876   빌리프 아이크림           6
1  5607714  04090791  프리메라 마스크팩           3
2  5607714  04090791      여성청결제           1
3  5612428  01876482       명품가방           1
4  5612428  00658123  콩순이 아이스크림           1

    SESS_DT     KWD_NM SEARCH_CNT
0  20180407      닥스원피스          8
1  20180407  닥터지 브라이트닝          1
2  20180407     달팡 인트랄          2
3  20180407        대상트          1
4  20180407       더블유닷          6

In [10]:
wtrfilter = search2[search2['KWD_NM'].str.contains('제습기')]
wtrfilter

          SESS_DT   KWD_NM SEARCH_CNT
903      20180406   마모스제습기          4
8667     20180412    lg제습기          3
13820    20180716   엘지 제습기          1
17071    20180422      제습기         83
18583    20180403   위니아제습기          2
...           ...      ...        ...
8031518  20180903    제습기커버          1
8032973  20180905  위닉스 제습기          8
8033494  20180903   위닉스제습기         36
8044136  20180915    신일제습기          2
8046871  20180903  위니아 제습기          1

[2497 rows x 3 columns]

In [12]:
wtrfilter.to_excel(excel_writer='/content/drive/My Drive/DataSet/Lpoint/data/wtrfilter.xlsx')